{"class_name": "Sequential", "config": [{"class_name": "Dropout", "config": {"rate": 0.4, "dtype": "float32", "batch_input_shape": [null, 1, 124, 32], "name": "dropout_1", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "valid", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "data_format": "channels_first", "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "relu", "filters": 40, "kernel_regularizer": null, "kernel_size": [1, 5]}}, {"class_name": "Permute", "config": {"dims": [3, 2, 1], "name": "permute_1", "trainable": true}}, {"class_name": "Reshape", "config": {"name": "reshape_1", "target_shape": [1, 28, 124, 40], "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_2", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv3D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "valid", "bias_regularizer": null, "dilation_rate": [1, 1, 1], "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1, 1], "trainable": true, "data_format": "channels_first", "name": "conv3d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "relu", "filters": 40, "kernel_regularizer": null, "kernel_size": [1, 124, 40]}}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_3", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Lambda", "config": {"name": "lambda_1", "arguments": {}, "output_shape_type": "raw", "output_shape": null, "function_type": "lambda", "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAAB8AABkAQATUykCTukCAAAAqQApAdoBeHICAAAAcgIA\nAAD6EWRyb3BvdXRDb252TmV0LnB52gg8bGFtYmRhPisAAABzAAAAAA==\n", null, null], "trainable": true}}, {"class_name": "Reshape", "config": {"name": "reshape_2", "target_shape": [40, 28, 1], "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_4", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "name": "average_pooling2d_1", "pool_size": [1, 5], "padding": "valid", "strides": [1, 1], "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_5", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 6, "trainable": true, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "softmax", "kernel_regularizer": null}}], "keras_version": "2.1.3", "backend": "tensorflow"}