{"backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "dilation_rate": [1, 1], "kernel_size": [1, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 124, 32], "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "trainable": true, "data_format": "channels_first", "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "filters": 40}}, {"class_name": "Permute", "config": {"trainable": true, "name": "permute_1", "dims": [3, 2, 1]}}, {"class_name": "Reshape", "config": {"trainable": true, "name": "reshape_1", "target_shape": [1, 28, 124, 40]}}, {"class_name": "Conv3D", "config": {"activation": "relu", "dilation_rate": [1, 1, 1], "kernel_size": [1, 124, 40], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv3d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_first", "padding": "valid", "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "strides": [1, 1, 1], "activity_regularizer": null, "filters": 40}}, {"class_name": "Lambda", "config": {"trainable": true, "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAAB8AABkAQATUykCTukCAAAAqQApAdoBeHICAAAAcgIA\nAAD6EWRyb3BvdXRDb252TmV0LnB52gg8bGFtYmRhPigAAABzAAAAAA==\n", null, null], "output_shape": null, "arguments": {}, "function_type": "lambda", "output_shape_type": "raw", "name": "lambda_1"}}, {"class_name": "Reshape", "config": {"trainable": true, "name": "reshape_2", "target_shape": [40, 28, 1]}}, {"class_name": "AveragePooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [1, 5], "strides": [1, 1], "data_format": "channels_last", "name": "average_pooling2d_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.2, "seed": null}}, {"class_name": "Dense", "config": {"activation": "softmax", "kernel_regularizer": null, "bias_constraint": null, "units": 6, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "name": "dense_1"}}], "keras_version": "2.1.3", "class_name": "Sequential"}