{"backend": "tensorflow", "config": [{"config": {"trainable": true, "batch_input_shape": [null, 1, 124, 32], "seed": null, "rate": 0.4, "name": "dropout_1", "noise_shape": null, "dtype": "float32"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "activation": "relu", "kernel_size": [1, 10], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 40, "bias_regularizer": null, "strides": [1, 1], "name": "conv2d_1", "trainable": true, "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "permute_1", "dims": [3, 2, 1]}, "class_name": "Permute"}, {"config": {"trainable": true, "name": "reshape_1", "target_shape": [1, 23, 124, 40]}, "class_name": "Reshape"}, {"config": {"trainable": true, "rate": 0.4, "name": "dropout_2", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "activation": "relu", "kernel_size": [1, 124, 40], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 40, "bias_regularizer": null, "strides": [1, 1, 1], "name": "conv3d_1", "trainable": true, "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1, 1], "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Conv3D"}, {"config": {"trainable": true, "rate": 0.4, "name": "dropout_3", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"arguments": {}, "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAAB8AABkAQATUykCTukCAAAAqQApAdoBeHICAAAAcgIA\nAAD6EWRyb3BvdXRDb252TmV0LnB52gg8bGFtYmRhPisAAABzAAAAAA==\n", null, null], "output_shape": null, "function_type": "lambda", "output_shape_type": "raw", "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"trainable": true, "name": "reshape_2", "target_shape": [40, 23, 1]}, "class_name": "Reshape"}, {"config": {"trainable": true, "rate": 0.4, "name": "dropout_4", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "padding": "valid", "pool_size": [1, 10], "data_format": "channels_last", "strides": [1, 2], "name": "average_pooling2d_1"}, "class_name": "AveragePooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "rate": 0.4, "name": "dropout_5", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "use_bias": true, "units": 6, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.1.3", "class_name": "Sequential"}