{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 5], "use_bias": true, "name": "conv2d_1", "strides": [1, 1], "padding": "valid", "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "batch_input_shape": [null, 1, 124, 32], "filters": 40, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "Permute", "config": {"trainable": true, "name": "permute_1", "dims": [3, 2, 1]}}, {"class_name": "Reshape", "config": {"trainable": true, "name": "reshape_1", "target_shape": [1, 28, 124, 40]}}, {"class_name": "Conv3D", "config": {"kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 124, 40], "strides": [1, 1, 1], "name": "conv3d_1", "use_bias": true, "padding": "valid", "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "filters": 40, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1, 1]}}, {"class_name": "Lambda", "config": {"arguments": {}, "output_shape_type": "raw", "function_type": "lambda", "trainable": true, "output_shape": null, "name": "lambda_1", "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAAB8AABkAQATUykCTukCAAAAqQApAdoBeHICAAAAcgIA\nAAD6EWRyb3BvdXRDb252TmV0LnB52gg8bGFtYmRhPigAAABzAAAAAA==\n", null, null]}}, {"class_name": "Reshape", "config": {"trainable": true, "name": "reshape_2", "target_shape": [40, 28, 1]}}, {"class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "pool_size": [1, 5], "strides": [1, 1], "trainable": true, "name": "average_pooling2d_1", "padding": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.4}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "name": "dense_1", "bias_constraint": null, "units": 6, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "activation": "softmax", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "keras_version": "2.1.3", "backend": "tensorflow"}