{"keras_version": "2.1.3", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [1, 5], "dtype": "float32", "name": "conv2d_1", "strides": [1, 1], "filters": 40, "data_format": "channels_first", "batch_input_shape": [null, 1, 124, 32], "use_bias": true, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null}}, {"class_name": "Permute", "config": {"dims": [3, 2, 1], "name": "permute_1", "trainable": true}}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [1, 28, 124, 40]}}, {"class_name": "Conv3D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "padding": "valid", "dilation_rate": [1, 1, 1], "kernel_size": [1, 124, 40], "name": "conv3d_1", "strides": [1, 1, 1], "filters": 40, "data_format": "channels_first", "use_bias": true, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null}}, {"class_name": "Lambda", "config": {"output_shape": null, "function_type": "lambda", "name": "lambda_1", "output_shape_type": "raw", "arguments": {}, "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAAB8AABkAQATUykCTukCAAAAqQApAdoBeHICAAAAcgIA\nAAD6EXNoYWxsb3dDb252TmV0LnB52gg8bGFtYmRhPigAAABzAAAAAA==\n", null, null]}}, {"class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "target_shape": [40, 28, 1]}}, {"class_name": "AveragePooling2D", "config": {"pool_size": [1, 5], "padding": "valid", "name": "average_pooling2d_1", "strides": [1, 1], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "units": 72, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "softmax", "bias_constraint": null, "kernel_constraint": null, "trainable": true}}]}