{"keras_version": "2.1.3", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "batch_input_shape": [null, 1, 124, 32], "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [1, 5], "activation": "relu", "kernel_constraint": null, "name": "conv2d_1", "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 40, "dtype": "float32"}}, {"class_name": "Permute", "config": {"trainable": true, "dims": [3, 2, 1], "name": "permute_1"}}, {"class_name": "Reshape", "config": {"trainable": true, "target_shape": [1, 28, 124, 40], "name": "reshape_1"}}, {"class_name": "Conv3D", "config": {"bias_constraint": null, "strides": [1, 1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [1, 124, 40], "activation": "relu", "kernel_constraint": null, "name": "conv3d_1", "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1, 1], "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 40}}, {"class_name": "Lambda", "config": {"trainable": true, "name": "lambda_1", "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAAB8AABkAQATUykCTukCAAAAqQApAdoBeHICAAAAcgIA\nAAD6EXNoYWxsb3dDb252TmV0LnB52gg8bGFtYmRhPkcAAABzAAAAAA==\n", null, null], "function_type": "lambda", "arguments": {}, "output_shape": null}}, {"class_name": "Reshape", "config": {"trainable": true, "target_shape": [40, 28, 1], "name": "reshape_2"}}, {"class_name": "AveragePooling2D", "config": {"trainable": true, "strides": [1, 1], "data_format": "channels_last", "padding": "valid", "pool_size": [1, 5], "name": "average_pooling2d_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "activity_regularizer": null, "activation": "softmax", "kernel_regularizer": null, "name": "dense_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "units": 6}}]}