{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Dropout", "config": {"seed": null, "dtype": "float32", "rate": 0.5, "batch_input_shape": [null, 1, 124, 32], "trainable": true, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_first", "bias_regularizer": null, "name": "conv2d_1", "activity_regularizer": null, "bias_constraint": null, "filters": 40, "activation": "relu", "padding": "valid", "kernel_size": [1, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null}}, {"class_name": "Permute", "config": {"trainable": true, "name": "permute_1", "dims": [3, 2, 1]}}, {"class_name": "Reshape", "config": {"trainable": true, "target_shape": [1, 28, 124, 40], "name": "reshape_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "seed": null, "rate": 0.5, "noise_shape": null}}, {"class_name": "Conv3D", "config": {"kernel_regularizer": null, "trainable": true, "use_bias": true, "dilation_rate": [1, 1, 1], "strides": [1, 1, 1], "data_format": "channels_first", "bias_regularizer": null, "name": "conv3d_1", "activity_regularizer": null, "bias_constraint": null, "filters": 40, "activation": "relu", "padding": "valid", "kernel_size": [1, 124, 40], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "seed": null, "rate": 0.5, "noise_shape": null}}, {"class_name": "Lambda", "config": {"trainable": true, "function_type": "lambda", "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAAB8AABkAQATUykCTukCAAAAqQApAdoBeHICAAAAcgIA\nAAD6EWRyb3BvdXRDb252TmV0LnB52gg8bGFtYmRhPisAAABzAAAAAA==\n", null, null], "name": "lambda_1", "output_shape_type": "raw", "output_shape": null, "arguments": {}}}, {"class_name": "Reshape", "config": {"trainable": true, "target_shape": [40, 28, 1], "name": "reshape_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "seed": null, "rate": 0.5, "noise_shape": null}}, {"class_name": "AveragePooling2D", "config": {"trainable": true, "padding": "valid", "name": "average_pooling2d_1", "strides": [1, 1], "data_format": "channels_last", "pool_size": [1, 5]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "seed": null, "rate": 0.5, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "name": "dense_1", "units": 6, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "use_bias": true, "kernel_constraint": null}}], "keras_version": "2.1.3"}