{"config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "trainable": true, "data_format": "channels_first", "dtype": "float32", "batch_input_shape": [null, 1, 124, 32], "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "name": "conv2d_1", "filters": 40, "padding": "valid", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_size": [1, 5], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "permute_1", "dims": [3, 2, 1]}, "class_name": "Permute"}, {"config": {"trainable": true, "name": "reshape_1", "target_shape": [1, 28, 124, 40]}, "class_name": "Reshape"}, {"config": {"rate": 0.4, "seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1, 1], "trainable": true, "data_format": "channels_first", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "conv3d_1", "strides": [1, 1, 1], "filters": 40, "padding": "valid", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_size": [1, 124, 40]}, "class_name": "Conv3D"}, {"config": {"function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAAB8AABkAQATUykCTukCAAAAqQApAdoBeHICAAAAcgIA\nAAD6EWRyb3BvdXRDb252TmV0LnB52gg8bGFtYmRhPikAAABzAAAAAA==\n", null, null], "trainable": true, "output_shape": null, "output_shape_type": "raw", "function_type": "lambda", "name": "lambda_1", "arguments": {}}, "class_name": "Lambda"}, {"config": {"trainable": true, "name": "reshape_2", "target_shape": [40, 28, 1]}, "class_name": "Reshape"}, {"config": {"pool_size": [1, 5], "trainable": true, "data_format": "channels_last", "padding": "valid", "name": "average_pooling2d_1", "strides": [1, 1]}, "class_name": "AveragePooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "trainable": true, "activity_regularizer": null, "name": "dense_1", "units": 6, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.3"}