{"config": [{"config": {"dilation_rate": [1, 1], "padding": "valid", "kernel_size": [1, 5], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "activity_regularizer": null, "batch_input_shape": [null, 1, 124, 32], "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "dtype": "float32", "filters": 40, "kernel_regularizer": null, "strides": [1, 1], "activation": "relu", "trainable": true, "kernel_constraint": null, "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "permute_1", "dims": [3, 2, 1]}, "class_name": "Permute"}, {"config": {"trainable": true, "target_shape": [1, 28, 124, 40], "name": "reshape_1"}, "class_name": "Reshape"}, {"config": {"dilation_rate": [1, 1, 1], "padding": "valid", "kernel_size": [1, 124, 40], "bias_constraint": null, "name": "conv3d_1", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "filters": 40, "kernel_regularizer": null, "strides": [1, 1, 1], "activation": "relu", "trainable": true, "kernel_constraint": null, "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv3D"}, {"config": {"output_shape": null, "output_shape_type": "raw", "function_type": "lambda", "name": "lambda_1", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAAB8AABkAQATUykCTukCAAAAqQApAdoBeHICAAAAcgIA\nAAD6EHJtTWVhblBvb2xOZXQucHnaCDxsYW1iZGE+IgAAAHMAAAAA\n", null, null], "arguments": {}}, "class_name": "Lambda"}, {"config": {"trainable": true, "target_shape": [40, 28, 1], "name": "reshape_2"}, "class_name": "Reshape"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "name": "dense_1", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 6, "kernel_regularizer": null, "activation": "softmax", "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.3"}