{"keras_version": "2.1.3", "backend": "tensorflow", "config": [{"config": {"kernel_constraint": null, "use_bias": true, "kernel_size": [1, 5], "batch_input_shape": [null, 1, 124, 32], "name": "conv2d_1", "padding": "valid", "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 40, "dilation_rate": [1, 1], "strides": [1, 1], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "dtype": "float32", "bias_constraint": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "permute_1", "dims": [3, 2, 1], "trainable": true}, "class_name": "Permute"}, {"config": {"target_shape": [1, 28, 124, 40], "name": "reshape_1", "trainable": true}, "class_name": "Reshape"}, {"config": {"kernel_constraint": null, "use_bias": true, "kernel_size": [1, 124, 40], "name": "conv3d_1", "padding": "valid", "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 40, "dilation_rate": [1, 1, 1], "strides": [1, 1, 1], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "bias_constraint": null, "trainable": true}, "class_name": "Conv3D"}, {"config": {"output_shape": null, "arguments": {}, "function_type": "lambda", "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAAB8AABkAQATUykCTukCAAAAqQApAdoBeHICAAAAcgIA\nAAD6EWRyb3BvdXRDb252TmV0LnB52gg8bGFtYmRhPigAAABzAAAAAA==\n", null, null], "output_shape_type": "raw", "name": "lambda_1", "trainable": true}, "class_name": "Lambda"}, {"config": {"target_shape": [40, 28, 1], "name": "reshape_2", "trainable": true}, "class_name": "Reshape"}, {"config": {"name": "average_pooling2d_1", "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "pool_size": [1, 5], "trainable": true}, "class_name": "AveragePooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"rate": 0.6, "name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "units": 6, "bias_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "bias_constraint": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}