{"config": [{"config": {"trainable": true, "batch_input_shape": [null, 1, 124, 32], "name": "dropout_1", "seed": null, "rate": 0.2, "noise_shape": null, "dtype": "float32"}, "class_name": "Dropout"}, {"config": {"use_bias": true, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "conv2d_1", "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 5], "kernel_constraint": null, "filters": 40}, "class_name": "Conv2D"}, {"config": {"name": "permute_1", "trainable": true, "dims": [3, 2, 1]}, "class_name": "Permute"}, {"config": {"name": "reshape_1", "trainable": true, "target_shape": [1, 28, 124, 40]}, "class_name": "Reshape"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"use_bias": true, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "conv3d_1", "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "strides": [1, 1, 1], "bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1, 1], "kernel_size": [1, 124, 40], "kernel_constraint": null, "filters": 40}, "class_name": "Conv3D"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAAB8AABkAQATUykCTukCAAAAqQApAdoBeHICAAAAcgIA\nAAD6EWRyb3BvdXRDb252TmV0LnB52gg8bGFtYmRhPisAAABzAAAAAA==\n", null, null], "name": "lambda_1", "output_shape_type": "raw", "arguments": {}, "output_shape": null, "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"name": "reshape_2", "trainable": true, "target_shape": [40, 28, 1]}, "class_name": "Reshape"}, {"config": {"name": "dropout_4", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "pool_size": [1, 5], "name": "average_pooling2d_1", "data_format": "channels_last", "padding": "valid", "strides": [1, 1]}, "class_name": "AveragePooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_5", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_1", "activation": "softmax", "bias_constraint": null, "trainable": true, "units": 6, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.3"}