{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Dropout", "config": {"noise_shape": null, "batch_input_shape": [null, 1, 124, 32], "seed": null, "name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.4}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 10], "padding": "valid", "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_first", "trainable": true, "name": "conv2d_1", "filters": 40}}, {"class_name": "Permute", "config": {"dims": [3, 2, 1], "name": "permute_1", "trainable": true}}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [1, 23, 124, 40]}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_2", "trainable": true, "noise_shape": null, "rate": 0.4}}, {"class_name": "Conv3D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 124, 40], "padding": "valid", "dilation_rate": [1, 1, 1], "bias_constraint": null, "strides": [1, 1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_first", "trainable": true, "name": "conv3d_1", "filters": 40}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_3", "trainable": true, "noise_shape": null, "rate": 0.4}}, {"class_name": "Lambda", "config": {"arguments": {}, "trainable": true, "output_shape": null, "output_shape_type": "raw", "name": "lambda_1", "function_type": "lambda", "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAAB8AABkAQATUykCTukCAAAAqQApAdoBeHICAAAAcgIA\nAAD6EWRyb3BvdXRDb252TmV0LnB52gg8bGFtYmRhPisAAABzAAAAAA==\n", null, null]}}, {"class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "target_shape": [40, 23, 1]}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_4", "trainable": true, "noise_shape": null, "rate": 0.4}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_5", "trainable": true, "noise_shape": null, "rate": 0.4}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "softmax", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "units": 6, "bias_constraint": null, "use_bias": true, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}], "keras_version": "2.1.3"}