{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "batch_input_shape": [null, 1, 124, 32], "seed": null, "dtype": "float32", "rate": 0.4, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"activation": "relu", "data_format": "channels_first", "kernel_constraint": null, "padding": "valid", "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "trainable": true, "kernel_size": [1, 5], "activity_regularizer": null, "filters": 40, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "Permute", "config": {"name": "permute_1", "trainable": true, "dims": [3, 2, 1]}}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [1, 28, 124, 40]}}, {"class_name": "Conv3D", "config": {"activation": "relu", "data_format": "channels_first", "kernel_constraint": null, "padding": "valid", "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv3d_1", "trainable": true, "kernel_size": [1, 124, 40], "activity_regularizer": null, "filters": 40, "strides": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "dilation_rate": [1, 1, 1]}}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "output_shape": null, "arguments": {}, "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAAB8AABkAQATUykCTukCAAAAqQApAdoBeHICAAAAcgIA\nAAD6EWRyb3BvdXRDb252TmV0LnB52gg8bGFtYmRhPikAAABzAAAAAA==\n", null, null], "output_shape_type": "raw", "function_type": "lambda"}}, {"class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "target_shape": [40, 28, 1]}}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [1, 5], "padding": "valid", "strides": [1, 1]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "softmax", "units": 6, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null}}], "keras_version": "2.1.3"}