{"config": [{"config": {"trainable": true, "batch_input_shape": [null, 1, 124, 32], "seed": null, "name": "dropout_1", "dtype": "float32", "noise_shape": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_size": [1, 5], "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_1", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "data_format": "channels_first", "padding": "valid", "filters": 40, "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "seed": null, "name": "dropout_2", "noise_shape": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "permute_1", "dims": [3, 2, 1]}, "class_name": "Permute"}, {"config": {"trainable": true, "name": "reshape_1", "target_shape": [1, 28, 124, 40]}, "class_name": "Reshape"}, {"config": {"trainable": true, "kernel_size": [1, 124, 40], "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "name": "conv3d_1", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "data_format": "channels_first", "padding": "valid", "filters": 40, "dilation_rate": [1, 1, 1], "activation": "relu", "use_bias": true, "activity_regularizer": null}, "class_name": "Conv3D"}, {"config": {"trainable": true, "seed": null, "name": "dropout_3", "noise_shape": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"function_type": "lambda", "trainable": true, "output_shape": null, "output_shape_type": "raw", "arguments": {}, "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAAB8AABkAQATUykCTukCAAAAqQApAdoBeHICAAAAcgIA\nAAD6EWRyb3BvdXRDb252TmV0LnB52gg8bGFtYmRhPisAAABzAAAAAA==\n", null, null], "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"trainable": true, "seed": null, "name": "dropout_4", "noise_shape": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "reshape_2", "target_shape": [40, 28, 1]}, "class_name": "Reshape"}, {"config": {"trainable": true, "strides": [1, 1], "pool_size": [1, 5], "name": "average_pooling2d_1", "data_format": "channels_last", "padding": "valid"}, "class_name": "AveragePooling2D"}, {"config": {"trainable": true, "seed": null, "name": "dropout_5", "noise_shape": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null, "use_bias": true, "activation": "softmax", "units": 6}, "class_name": "Dense"}, {"config": {"trainable": true, "seed": null, "name": "dropout_6", "noise_shape": null, "rate": 0.2}, "class_name": "Dropout"}], "keras_version": "2.1.3", "class_name": "Sequential", "backend": "tensorflow"}