{"backend": "tensorflow", "keras_version": "2.1.3", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_first", "batch_input_shape": [null, 1, 124, 32], "kernel_constraint": null, "name": "conv2d_1", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 40, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [1, 5], "activation": "relu", "dtype": "float32"}}, {"class_name": "Permute", "config": {"dims": [3, 2, 1], "trainable": true, "name": "permute_1"}}, {"class_name": "Reshape", "config": {"target_shape": [1, 28, 124, 40], "trainable": true, "name": "reshape_1"}}, {"class_name": "Conv3D", "config": {"data_format": "channels_first", "kernel_constraint": null, "bias_constraint": null, "name": "conv3d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 40, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1, 1], "kernel_size": [1, 124, 40], "activation": "relu"}}, {"class_name": "Lambda", "config": {"function_type": "lambda", "arguments": {}, "name": "lambda_1", "output_shape_type": "raw", "output_shape": null, "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAAB8AABkAQATUykCTukCAAAAqQApAdoBeHICAAAAcgIA\nAAD6EWRyb3BvdXRDb252TmV0LnB52gg8bGFtYmRhPigAAABzAAAAAA==\n", null, null]}}, {"class_name": "Reshape", "config": {"target_shape": [40, 28, 1], "trainable": true, "name": "reshape_2"}}, {"class_name": "AveragePooling2D", "config": {"padding": "valid", "data_format": "channels_last", "name": "average_pooling2d_1", "strides": [1, 1], "pool_size": [1, 5], "trainable": true}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "units": 6, "trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax"}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.6, "noise_shape": null, "trainable": true, "name": "dropout_1"}}]}