{"config": [{"class_name": "Conv2D", "config": {"use_bias": true, "trainable": true, "data_format": "channels_first", "dtype": "float32", "dilation_rate": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "batch_input_shape": [null, 1, 124, 32], "strides": [1, 1], "name": "conv2d_1", "filters": 40, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activation": "relu", "kernel_size": [1, 5]}}, {"class_name": "Permute", "config": {"name": "permute_1", "trainable": true, "dims": [3, 2, 1]}}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [1, 28, 124, 40]}}, {"class_name": "Conv3D", "config": {"use_bias": true, "trainable": true, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1, 1], "name": "conv3d_1", "filters": 40, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activation": "relu", "kernel_size": [1, 124, 40]}}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAAB8AABkAQATUykCTukCAAAAqQApAdoBeHICAAAAcgIA\nAAD6EWRyb3BvdXRDb252TmV0LnB52gg8bGFtYmRhPigAAABzAAAAAA==\n", null, null], "output_shape": null, "function_type": "lambda", "arguments": {}, "output_shape_type": "raw"}}, {"class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "target_shape": [40, 28, 1]}}, {"class_name": "AveragePooling2D", "config": {"strides": [1, 1], "name": "average_pooling2d_1", "trainable": true, "pool_size": [1, 5], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_1", "units": 6, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax"}}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null}}], "keras_version": "2.1.3", "class_name": "Sequential", "backend": "tensorflow"}