{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.3", "config": [{"class_name": "Dropout", "config": {"batch_input_shape": [null, 1, 124, 32], "noise_shape": null, "name": "dropout_1", "seed": null, "dtype": "float32", "trainable": true, "rate": 0.4}}, {"class_name": "Conv2D", "config": {"filters": 40, "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "kernel_size": [1, 5], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "bias_regularizer": null, "name": "conv2d_1"}}, {"class_name": "Dropout", "config": {"rate": 0.4, "noise_shape": null, "trainable": true, "name": "dropout_2", "seed": null}}, {"class_name": "Permute", "config": {"dims": [3, 2, 1], "trainable": true, "name": "permute_1"}}, {"class_name": "Reshape", "config": {"trainable": true, "name": "reshape_1", "target_shape": [1, 28, 124, 40]}}, {"class_name": "Conv3D", "config": {"filters": 40, "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "kernel_size": [1, 124, 40], "dilation_rate": [1, 1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "strides": [1, 1, 1], "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "bias_regularizer": null, "name": "conv3d_1"}}, {"class_name": "Dropout", "config": {"rate": 0.4, "noise_shape": null, "trainable": true, "name": "dropout_3", "seed": null}}, {"class_name": "Lambda", "config": {"name": "lambda_1", "arguments": {}, "function_type": "lambda", "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAAB8AABkAQATUykCTukCAAAAqQApAdoBeHICAAAAcgIA\nAAD6EWRyb3BvdXRDb252TmV0LnB52gg8bGFtYmRhPisAAABzAAAAAA==\n", null, null], "output_shape_type": "raw", "output_shape": null, "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.4, "noise_shape": null, "trainable": true, "name": "dropout_4", "seed": null}}, {"class_name": "Reshape", "config": {"trainable": true, "name": "reshape_2", "target_shape": [40, 28, 1]}}, {"class_name": "AveragePooling2D", "config": {"strides": [1, 1], "name": "average_pooling2d_1", "padding": "valid", "data_format": "channels_last", "pool_size": [1, 5], "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.4, "noise_shape": null, "trainable": true, "name": "dropout_5", "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 6, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "softmax", "bias_regularizer": null, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"rate": 0.4, "noise_shape": null, "trainable": true, "name": "dropout_6", "seed": null}}]}