{"backend": "tensorflow", "config": [{"config": {"batch_input_shape": [null, 1, 124, 32], "name": "dropout_1", "noise_shape": null, "seed": null, "trainable": true, "dtype": "float32", "rate": 0.6}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "name": "conv2d_1", "kernel_size": [1, 5], "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "data_format": "channels_first", "kernel_regularizer": null, "filters": 40, "use_bias": true, "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "seed": null, "rate": 0.6, "name": "dropout_2", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"dims": [3, 2, 1], "name": "permute_1", "trainable": true}, "class_name": "Permute"}, {"config": {"target_shape": [1, 28, 124, 40], "name": "reshape_1", "trainable": true}, "class_name": "Reshape"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "name": "conv3d_1", "kernel_size": [1, 124, 40], "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "data_format": "channels_first", "kernel_regularizer": null, "filters": 40, "use_bias": true, "strides": [1, 1, 1], "trainable": true, "dilation_rate": [1, 1, 1], "activity_regularizer": null}, "class_name": "Conv3D"}, {"config": {"trainable": true, "seed": null, "rate": 0.6, "name": "dropout_3", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"function_type": "lambda", "output_shape_type": "raw", "name": "lambda_1", "output_shape": null, "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAAB8AABkAQATUykCTukCAAAAqQApAdoBeHICAAAAcgIA\nAAD6EWRyb3BvdXRDb252TmV0LnB52gg8bGFtYmRhPisAAABzAAAAAA==\n", null, null], "arguments": {}, "trainable": true}, "class_name": "Lambda"}, {"config": {"trainable": true, "seed": null, "rate": 0.6, "name": "dropout_4", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"target_shape": [40, 28, 1], "name": "reshape_2", "trainable": true}, "class_name": "Reshape"}, {"config": {"padding": "valid", "name": "average_pooling2d_1", "strides": [1, 1], "data_format": "channels_last", "pool_size": [1, 5], "trainable": true}, "class_name": "AveragePooling2D"}, {"config": {"trainable": true, "seed": null, "rate": 0.6, "name": "dropout_5", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "units": 6, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "seed": null, "rate": 0.6, "name": "dropout_6", "noise_shape": null}, "class_name": "Dropout"}], "keras_version": "2.1.3", "class_name": "Sequential"}